name: "pipeline"
backend: "python"
max_batch_size: 0

input [
    {
        name: "input_text"
        data_type: TYPE_STRING
        dims: [-1, 1]
    }
]

output [
    {
        name: "paraphrase_answer"
        data_type: TYPE_STRING
        dims: [-1, 1]
    }
]